In [1]:
import pandas as pd

In [2]:
sales_data = {'City': ['New York', 'New York', 'Paris', 'Paris', 'London', 'London', 'New York', 'Paris'],
              'Product': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'A'],
              'Sales': [100, 200, 150, 250, 130, 220, 170, 180]}

df_sales = pd.DataFrame(sales_data)

In [3]:
df_sales

       City Product  Sales
0  New York       A    100
1  New York       B    200
2     Paris       A    150
3     Paris       B    250
4    London       A    130
5    London       B    220
6  New York       A    170
7     Paris       A    180

##### Calculate the total and average sales per city.

In [4]:
# total sales per city
df_sales.groupby('City')['Sales'].sum()

City
London      350
New York    470
Paris       580
Name: Sales, dtype: int64

In [5]:
# average sales per city
df_sales.groupby('City')['Sales'].mean()

City
London      175.000000
New York    156.666667
Paris       193.333333
Name: Sales, dtype: float64


##### Find out which city had the highest sales for each product.

In [6]:
df_sales.groupby('Product')['City'].max()

Product
A    Paris
B    Paris
Name: City, dtype: object


##### Create a pivot table that shows total sales per city and product.

In [7]:
df_sales.pivot_table(values='Sales', index='City', aggfunc='sum')

          Sales
City
London      350
New York    470
Paris       580

In [8]:
df_sales.sort_values(by='Sales')

       City Product  Sales
0  New York       A    100
4    London       A    130
2     Paris       A    150
6  New York       A    170
7     Paris       A    180
1  New York       B    200
5    London       B    220
3     Paris       B    250

In [9]:
df = pd.DataFrame({'Name': ['  Alice   ', 'BOB', '  Charlie   ', 'DAVID    '],
 'City': ['New York', 'Paris', 'LONDON', 'Berlin']})
df

           Name      City
0      Alice     New York
1           BOB     Paris
2    Charlie       LONDON
3     DAVID        Berlin

In [10]:
df['lowercase_name'] = df['Name'].str.lower()
df

           Name      City lowercase_name
0      Alice     New York       alice
1           BOB     Paris            bob
2    Charlie       LONDON     charlie
3     DAVID        Berlin      david

In [11]:
df['uppercase_name'] = df['Name'].str.upper()
df

           Name      City lowercase_name uppercase_name
0      Alice     New York       alice          ALICE
1           BOB     Paris            bob            BOB
2    Charlie       LONDON     charlie        CHARLIE
3     DAVID        Berlin      david          DAVID

In [12]:
df['strip_Name'] = df['Name'].str.strip()
df

           Name      City lowercase_name uppercase_name strip_Name
0      Alice     New York       alice          ALICE         Alice
1           BOB     Paris            bob            BOB        BOB
2    Charlie       LONDON     charlie        CHARLIE       Charlie
3     DAVID        Berlin      david          DAVID          DAVID

In [13]:
df2 = pd.DataFrame({'Full_Name': ['Alice Johnson', 'Bob Smith', 'Charlie Brown']})
df2

       Full_Name
0  Alice Johnson
1      Bob Smith
2  Charlie Brown

In [14]:
df2[['First Name', 'Last Name']] = df2['Full_Name'].str.split(expand=True)
df2

       Full_Name First Name Last Name
0  Alice Johnson      Alice   Johnson
1      Bob Smith        Bob     Smith
2  Charlie Brown    Charlie     Brown

In [25]:
iris = pd.read_csv('Iris.csv', usecols=range(1,6))
iris.head()

   SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0            5.1           3.5            1.4           0.2  Iris-setosa
1            4.9           3.0            1.4           0.2  Iris-setosa
2            4.7           3.2            1.3           0.2  Iris-setosa
3            4.6           3.1            1.5           0.2  Iris-setosa
4            5.0           3.6            1.4           0.2  Iris-setosa

In [ ]:
iris['Species'] = iris['Species'].str.split('-').str[-1]

In [36]:
iris.head()

   SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm Species
0            5.1           3.5            1.4           0.2  setosa
1            4.9           3.0            1.4           0.2  setosa
2            4.7           3.2            1.3           0.2  setosa
3            4.6           3.1            1.5           0.2  setosa
4            5.0           3.6            1.4           0.2  setosa

In [39]:
df_datetime =pd.DataFrame({
    'Event': ['Meeting', 'Workshop', 'Conference'],
    'Date': ['2025-04-01', '2025-04-02', '2025-04-03']})
df_datetime

        Event        Date
0     Meeting  2025-04-01
1    Workshop  2025-04-02
2  Conference  2025-04-03

In [43]:
pd.to_datetime(df_datetime['Date']).dt.day_name()

0      Tuesday
1    Wednesday
2     Thursday
Name: Date, dtype: object